In [1]:
# !pip install scikit-learn
# independent-label and dependent is called feature

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv(r"C:\Users\rnkha\OneDrive\Desktop\ml.data1.csv")
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  64000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  68000.0       Yes
6    Spain   NaN  62000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
x=df[['Country','Age','Salary']].copy()

In [5]:
y=df['Purchased'].copy()
y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [6]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [7]:
from sklearn.impute import SimpleImputer

In [8]:
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')

In [9]:
x

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  64000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  68000.0
6    Spain   NaN  62000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [10]:
x.loc[:,['Age','Salary']]=imputer.fit_transform(x.loc[:,['Age','Salary']])

In [11]:
x

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  64000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  67111.111111
5   France  35.000000  68000.000000
6    Spain  38.777778  62000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [12]:
# Encoding Categorical Data
from sklearn.preprocessing import LabelEncoder

In [13]:
label_x=LabelEncoder()

In [14]:
x.iloc[:,0]=label_x.fit_transform(x.iloc[:,0])

In [15]:
x

  Country        Age        Salary
0       0  44.000000  72000.000000
1       2  27.000000  48000.000000
2       1  30.000000  64000.000000
3       2  38.000000  61000.000000
4       1  40.000000  67111.111111
5       0  35.000000  68000.000000
6       2  38.777778  62000.000000
7       0  48.000000  79000.000000
8       1  50.000000  83000.000000
9       0  37.000000  67000.000000

In [16]:
label_y=LabelEncoder()

In [17]:
y=label_y.fit_transform(y)

In [18]:
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])

In [19]:
from sklearn.model_selection import train_test_split

In [20]:
x_train,x_test , y_train,y_test =train_test_split(x,y,test_size=0.2,random_state=2)

In [21]:
x_train.shape

(8, 3)

In [22]:
x_test.shape

(2, 3)

In [23]:
# Feature Scaling

In [24]:
from sklearn.preprocessing import StandardScaler

In [25]:
sc_x=StandardScaler()

In [26]:
x_train

  Country        Age   Salary
5       0  35.000000  68000.0
0       0  44.000000  72000.0
7       0  48.000000  79000.0
2       1  30.000000  64000.0
3       2  38.000000  61000.0
6       2  38.777778  62000.0
9       0  37.000000  67000.0
8       1  50.000000  83000.0

In [27]:
x_train=sc_x.fit_transform(x_train)
x_test=sc_x.fit_transform(x_test)

In [28]:
x_train

array([[-0.90453403, -0.80667524, -0.20089486],
       [-0.90453403,  0.61764507,  0.33482477],
       [-0.90453403,  1.25067632,  1.27233411],
       [ 0.30151134, -1.5979643 , -0.73661448],
       [ 1.50755672, -0.3319018 , -1.1384042 ],
       [ 1.50755672, -0.20881239, -1.0044743 ],
       [-0.90453403, -0.49015961, -0.33482477],
       [ 0.30151134,  1.56719195,  1.80805373]])

In [29]:
x_test

array([[-1.,  1.,  1.],
       [ 1., -1., -1.]])